1## **Итоговая контрольная работа к основному блоку**

1. Создать репозиторий на GitHub

2.  Нарисовать алгоритм блок-схемы

3. Создать репозиторий оформленным текстовым описанием решений (файл README.md)

4. Написать программу, решающую поставленную задачу

5. Использовать метод контроля в работе над этим небольшим проектом

## Задача:
**_Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами_**

## Описание решения:

1. Выводим текст запроса пользователю для определения размера исходного массива с помощью метода Console.Write

2. Считываем введенный размер (Console.ReadLine)

3. Создаем массив требуемого размера (num) заполненный 0

4. Функция string[] CreateArray(), вызываемая {string.Join()}, запрашивает стоки у пользователя, собирает в массив и выводит их на экран. Перед массивом при помощи интерполяции строка перед массивом выводится текст "Исходный массив:", сам массив выводится через запятую и табуляцию.

5. Функция int CheckArray() считает количество элементов в массиве, содержащих не более 3 символов.

6. Функция string[] NewArray(), вызванная {string.Join()}, берет исходный массив, затем элементы на соответствие кол-во символов (<= 3), заполняет основу элементов массива, длина которого берется из int CheckArray(). Массив выводитcя на экран, перед ним при помощи интерполяционной строки выводится текст «Конечный массив:», сам массив выводится через запятую и табуляцию.